# დაბეჭდე 1-დან 50-მდე ყველა ლუწი რიცხვი.
# დათვალე 1-დან 100-მდე რიცხვების ჯამი.
# დაბეჭდე რიცხვის (მაგ. 7) გამრავლების ტაბულა: 7×1-დან 7×10-მდე.
# მომხმარებელმა შეიყვანოს სიტყვა და დათვალე, რამდენი ხმოვანია მასში.
# დაბეჭდე 1-დან 30-მდე რიცხვები, რომლებიც იყოფა 3-ზე ან 5-ზე.

# WHILE ციკლი
# დაბეჭდე 10-დან 1-მდე უკუღმა.
# სანამ მომხმარებელი არ შეიყვანს 0-ს, კითხე რიცხვები და ბოლოს დაბეჭდე მათი ჯამი.
# დათვალე, რამდენ ციფრს შეიცავს რიცხვი (მაგ. 12345 → 5).
# გამოიცანი რიცხვი: პროგრამას აქვს რიცხვი 7, მომხმარებელი შეყავს, სანამ არ გამოიცნობს.
# იპოვე რიცხვის ციფრთა ჯამი (მაგ. 123 → 6).

# LIST (სია)
# შექმენი 5 რიცხვის სია და დაბეჭდე მათი ჯამი.
# იპოვე სიაში უდიდესი და უმცირესი რიცხვი (max/min-ის გარეშე).
# სიიდან დაბეჭდე მხოლოდ ლუწი რიცხვები.








#1)
for i in (30):
   if i % 3==30:




















