# 1. შექმენი სია:
# ["ვაშლი", "ბანანი", "ატამი"]

# append() მეთოდის გამოყენებით დაამატე სიაში "მსხალი".
# შემდეგ გამოიტანე მიღებული სია.

# 2. შექმენი სია:
# ["HTML", "CSS", "JavaScript", "Python"]

# insert() მეთოდის გამოყენებით ჩასვი "React" მესამე პოზიციაზე.
# შემდეგ გამოიტანე მიღებული სია.

# 3. შექმენი სია:
# ["თბილისი", "ბათუმი", "ქუთაისი", "რუსთავი"]

# remove() მეთოდის გამოყენებით წაშალე "ქუთაისი".
# შემდეგ გამოიტანე მიღებული სია.

# 4. შექმენი რიცხვების სია:
# [10, 20, 30, 40, 50]

# pop() მეთოდის გამოყენებით წაშალე სიის ბოლო ელემენტი.
# შემდეგ გამოიტანე წაშლილი ელემენტი და მიღებული სია.

# 5. შექმენი სია:
# ["Python", "JavaScript", "Java", "C++"]

# clear() მეთოდის გამოყენებით მთლიანად გაასუფთავე სია.
# შემდეგ გამოიტანე მიღებული სია.




#1)
ხილი = ["ვაშლი", "ბანანი", "ატამი"]
ხილი.append("მსხალი")
print(ხილი)


#2)
ტექნოლოგიები = ["HTML", "CSS", "JavaScript", "Python"]
ტექნოლოგიები.insert(2, "React")
print(ტექნოლოგიები)


#3)
ქალაქები = ["თბილისი", "ბათუმი", "ქუთაისი", "რუსთავი"]
ქალაქები.remove("ქუთაისი")
print(ქალაქები)


#4)
რიცხვები = [10, 20, 30, 40, 50]
წაშლილი_ელემენტი = რიცხვები.pop()
print("წაშლილი ელემენტი:", წაშლილი_ელემენტი)
print("მიღებული სია:", რიცხვები


#5)
ენები = ["Python", "JavaScript", "Java", "C++"]
ენები.clear()
print(ენები)