# 1) კომენტარებით ახსენით რას აკეთებს პროცენტული გაყოფა ( % )
# 2) ახსენით როგორ უნდა ავიყვანოთ რიცხვი ხარისხში
# 3) შექმენი ვლადი და შიგნით 5 აიყვანე 2 ხარისხში, შემდეგ კი დაპრინტე ეს ცვლადი. კომენტარით მიუწერე რა იქნება შედეგი
# 4) კომენტარში დაწერეთ რას გამოიტანს 13%3
# 5) კომენტარებით  ახსენით რა არის მონაცემთა ტიპები
# 6) ჩამოწერეთ ყველა მოაცემთა ტიპი
# 7) ჩამოწერილ მონაცემთა ტიპებს მიუწერეთ განმარტებები
# 8) შექმენი სახელის ცვლადი სადაც შეინახავ შენს ასაკს, შემდეგ შექმენი ცვლადი სადაც შეინახავ  გყავს თუ არა შინაური ცხოველი, საბოლოოდ
# დაპრინტე ორივე ცვლადი.
# 9) შექმენი ცვლადი სადაც შეინახავ შენი მეგობრის სახელს, შემდეგ შექმენი ცვლადი სადაც შეინახავ მეგობრის ასაკს, შექმენი ცვლადი
# სადაც შეინახავ მეოგბრის სიმაღლეს და შემდეგ დავეჭდე ყველა  ცვლადი

#1) % ეს არის ნაშთიანი გაყოფა და ეს გვიბრუნებს ნაშთს
#2) რიცხვის ხარისხში აყვანა ხდება ორი ფიფქით **
#3) 
nam=5**2
print(nam)
#4) ეს გამიგვიტანს 1_ს
#5) მონაცემთა ტიპები განსაზღვრავს თუ რა მნიშვნელობა ინახება ცვლადში
# boolen 
#float
#integer
#str



#7) boolen არის true end false
#float არის ათწილადი რიცხვები
#integer  არის ყველა მთელი რიცხვი
#str  str არის ყველაფერი რაც იწერება ფრჩხილებში 


#8) 
age=12
pet="yes"



#9) 
frend_name='sandro'
frend_age=12
frend_height=1.50
print(frend_name)
print(frend_age)
print(frend_height)


