#1) კომენტარებით ახსენით რას აკეთებს ნაშთიანი გაყოფის ოპერატორი ( % ).

#2) კომენტარებით ახსენით როგორ უნდა ავიყვანოთ რიცხვი ხარისხში Python-ში.

#3) შექმენი ცვლადი, სადაც შეინახავ 6-ის მეორე ხარისხს. შემდეგ დაბეჭდე ეს ცვლადი. კომენტარით მიუწერე რა იქნება შედეგი.

#4) კომენტარებში დაწერე რას გამოიტანს:
   #- 17 % 5
   #- 25 % 4
   #- 30 % 7

#5) კომენტარებით ახსენით რა არის მონაცემთა ტიპები (Data Types).

#6) ჩამოწერე Python-ის ძირითადი მონაცემთა ტიპები.

#7) თითოეულ მონაცემთა ტიპს კომენტარებით მიუწერე განმარტება.

#8) შექმენი ცვლადი, სადაც შეინახავ შენს სახელს, მეორე ცვლადში შენს ასაკს, ხოლო მესამე ცვლადში იმას, გყავს თუ არა შინაური ცხოველი. 
#შემდეგ დაბეჭდე ყველა ცვლადი.

#9) შექმენი ცვლადი, სადაც შეინახავ შენი მეგობრის სახელს, მეორე ცვლადში მის ასაკს, ხოლო მესამე ცვლადში მის სიმაღლეს. შემდეგ დაბეჭდე
#ყველა ცვლადი.

#10) შექმენი ორი რიცხვითი ცვლადი. იპოვე მათი ჯამი, სხვაობა, ნამრავლი, განაყოფი და ნაშთი. თითოეული შედეგი დაბეჭდე.

#11) შექმენი ცვლადი number, სადაც შეინახავ ნებისმიერ რიცხვს. აიყვანე ის მესამე ხარისხში და დაბეჭდე შედეგი.

#12) შექმენი Boolean ტიპის ორი ცვლადი: ერთში შეინახე True, მეორეში False. შემდეგ ორივე დაბეჭდე.

#13) კომენტარებით ახსენით რა განსხვავებაა int-სა და float-ს შორის.


#14) შექმენი ცვლადი `price`, სადაც შეინახავ პროდუქტის ფასს, და ცვლადი `quantity`, სადაც შეინახავ რაოდენობას. გამოთვალე საერთო
#ღირებულება და დაბეჭდე.

#15) რისთვის გამოიყენება print() ფუნქცია Python-ში

#1) პრცენტული გაყოფა გვეხმარება ნაშთის მიღებაში

#2) pyton_ში ხარისხში აყვანა ხდება ორი ფიფქით **

#3) 
nam=6**2
print(nam)

#4)
- 17 % 5=2
- 25 % 4=1
- 30 % 7=2

#5) (data types) არის მონაცემთა ტიპი რომელიც კომპიუტერს ეუბნება, თუ რა სახის მონაცემთან აქვს საქმე

#6) pyton_ის ძირითადი ტიპებია 
# intenger
# floats
# strings
# booleans 

#7)
# intenger ტექსტური ინფორმაცია. მოთავსებულია ბრჭყალებში. მაგალითი: "გამარჯობა".
# floats რიცხვი ათწილადის გარეშე. მაგალითები: -5, 0, 10
# strings რიცხვი წერტილით ან ათწილადით. მაგალითები: 3.14, -0.5.
# booleans  მხოლოდ ორი მნიშვნელობა აქვს: True (ჭეშმარიტი) ან False (მცდარი).

#8) 
my_name="demetre" 
my_hight=1.54
my_age=12
print(my_name)
print(my_hight)
print(my_age)

#9)
frend_name="joni"
frend_age=11
frend_hight=1.48
print(frend_name)
print(frend_age)
print(frend_hight)

#10)
- 11 - 5=6
- 11 + 5=16
- 11 / 5=2
- 11 ** 5=161,051

#11)
- 5 ** 3=125

#12)
is_open=True
is_closed=False

#13)პროგრამირებაში int და float არის მონაცემთა ტიპები, რომლებიც გამოიყენება რიცხვების შესანახად.
#მთავარი განსხვავება მათ შორის არის ის, რომ int ინახავს მხოლოდ მთელ რიცხვებს, ხოლო float — წილად (ათწილად) რიცხვებს.

#14) 
price=5
quantity=10

#15) Python-ში print() ფუნქცია გამოიყენება მონაცემების ეკრანზე გამოსატანად და არა კომენტარის დასაწერად.









