#1) შექმენი ორი ცვლადი სადაც მომხმარელებს შემოატანინებ რიცხვებს
#2) პირველ დავალებაში შექმნილი ცვლადები გადაიყვანე ინტეჯერად რო მოახდინო მათემატიკური მოქმედებები
#3) დაბეჭდე ყველა მათემატიკური მოქმედება წინა დავალებაში შექმნილ ცვლადებზე (+, -, *, /, %, //)
#4)  შექმენი ცვლადები სადაც მომხმარებელს შემოატანინებ სახელს და ასაკს
#5) დაბეჭდე f სტრინგით "My name is {მომხმარებლის სახელი} and my age is {მომხმარებლის ასაკი}" 
#(გამოიყენე მეოთხე დავალებაში შექმნილი ცვლადები)


#1)
first_namber = int(input("შეიყვანეთ პირველი რიცხვი: "))
second_namber = int(input("შეიყვანეთ მეორე რიცხვი: "))















