#1) კომენტარების სახით ახსენით რა არის input ფუნქცია და რისთვის გამოიყენება
#2) მომხმარებელს შემოატანინე თავისი სახელი და დაბეჭდე რა სახელი შემოიტანა
#3) მომხმარებელს შემოატანინე თავისი საყვარელი ფერი და დაპეჭდეთ
#4) კომენტარებით ახსენით რა არის f sring
#5) მომხმარებელს შემაოყვანინე თავისი ასაკი და დაბეჭდეთ fსტრინგით "I am {მომხმარებლის ასაკი აქ} years old"

#1) input() ფუნქცია არის ბრძანება. ის პროგრამას აძლევს საშუალებას, მიიღოს ინფორმაცია თქვენგან
#2) პროგრამირებაში მომხმარებლისგან ტექსტის (მაგალითად, სახელის) შემოტანას და მის ეკრანზე დაბეჭდვას Python-ის მაგალითზე მარტივად
#შეასრულებთ შემდეგი კოდის
#3)
color = input("რა არის შენი საყვარელი ფერი? ")
print(color)
 #4) f_string  (ფორმატირებული სტრიქონი) არის პითონის (Python) მარტივი ხელსაწყო, რომელიც გაძლევს საშუალებას ტექსტში 
 #პირდაპირ ჩასვა ცვლადები და მათემატიკური მოქმედებები. ტექსტის წინ ვწერთ 'f'-ს, ხოლო ცვლადებს ვათავსებთ ფიგურულ ფრჩხილებში   
#5)ეს არის მარტივი და გა
#საგები კოდი Python-ის გამოყენებით. ის ჯერ ეკითხება მომხმარებელს ასაკს, შემდეგ კი ბეჭდავს სასურველ ფრაზას f-string-ის დახმარებით.









