#1)კომენტარების სახით ახსენით რა არის input() ფუნქცია და რისთვის გამოიყენება.
#2) მომხმარებელს შემოატანინეთ თავისი სახელი და დაბეჭდეთ, რა სახელი შემოიტანა.
#3) მომხმარებელს შემოატანინეთ თავისი საყვარელი ფერი და დაბეჭდეთ.
#4) კომენტარებით ახსენით, რა არის f-string და რატომ არის მისი გამოყენება მოსახერხებელი.
#5) მომხმარებელს შემოატანინეთ თავისი ასაკი და f-string-ის გამოყენებით დაბეჭდეთ:
#I am {ასაკი} years old
#6) მომხმარებელს შემოატანინეთ თავისი გვარი და f-string-ის გამოყენებით დაბეჭდეთ:
#Your surname is {გვარი}
#7) მომხმარებელს შემოატანინეთ თავისი საყვარელი ცხოველი და დაბეჭდეთ:
#My favorite animal is {ცხოველი}
#f-string-ის გამოყენებით.
#8) მომხმარებელს შემოატანინეთ თავისი საყვარელი სპორტი და დაბეჭდეთ:
#I like {სპორტი}
#f-string-ის გამოყენებით.
#9) მომხმარებელს შემოატანინეთ ქალაქის სახელი და ქვეყანა. შემდეგ f-string-ის გამოყენებით დაბეჭდეთ:
#I live in {ქალაქი}, {ქვეყანა}
#10) მომხმარებელს შემოატანინეთ თავისი სახელი, ასაკი და საყვარელი ფერი. შემდეგ f-string-ის გამოყენებით დაბეჭდეთ:
#My name is {სახელი}, I am {ასაკი} years old and my favorite color is {ფერი}.





























































