# 1) დაწერეთ პროგრამა, რომელიც Nested Loop-ის გამოყენებით დაიბეჭდავს 3x3-ზე ვარსკვლავების კვადრატს.

# მოსალოდნელი შედეგი:
# * * *
# * * *
# * * *

# 2) გამოიყენეთ ციკლები ციკლში, რათა დაიბეჭდოს 3 სტრიქონი, სადაც თითოეულ სტრიქონში იქნება რიცხვები 1-დან 4-მდე.

# მოსალოდნელი შედეგი:
# 1 2 3 4
# 1 2 3 4
# 1 2 3 4

# 3) Nested Loop-ის გამოყენებით დაიბეჭდეთ გამრავლების ტაბულა 1-დან 3-მდე რიცხვებისთვის.

# მოსალოდნელი შედეგი:
# 1 x 1 = 1
# 1 x 2 = 2
# 1 x 3 = 3
# 2 x 1 = 2
# 2 x 2 = 4
# 2 x 3 = 6
# 3 x 1 = 3
# 3 x 2 = 6
# 3 x 3 = 9







#1)
for i in range(3):
    for j in range(3):
        print("*", end=" ")



#2)
or i in range(3):
    for j in range(1, 5):
        print(j, end=" ")




#3)
for i in range(1, 4):
    for j in range(1, 4):
        print(f"{i} x {j} = {i * j}")
        





















































