# 1) მომხმარებელს შემოატანინე თავისი ასაკი, შემდეგ შეამოწმე თავისი ასაკია მეტია ან ტოლია 18ზე, კონსოლში გამოვიდეს "სრულწლოვანიხართ".
# თუ ნაკლებია ასაკი 18ზე გამოვიდეს "არასრულწლოვანი ხართ"
# 2) მომხმარებელს შემოატანინე ორი რიცხვი (num1, num2), შეამოწმე თუ num1 მეტია num2ზე გამოვიდეს "პირველი რიცხვი მეტია",
# თუ num2 მეტია num1ზე გამოვიდეს "მეორე რიცხვი მეტია"
# 3) მომხმარებელს კიღხე რა არის სწორი რიცხვი. თუ რიცხვი უდრის 777 დაბეჭდოს "რიცხვი გამოცნობილია"
# 4) მომხმარებელს შემოატანინე თავისი სიმაღლე, თუ სიმაღლე მეტია ან უდრის 1.70ზე დაბეჭდოს "შენ მაღალი ხარ



























