# 1) მომხმარებელს შემოატანინე ასაკი. თუ ასაკი არის 18 ან მეტი, დაბეჭდე:
# "შენ სრულწლოვანი ხარ."

# 2) მომხმარებელს შემოატანინე რიცხვი. თუ ის დადებითია, დაბეჭდე:
# "დადებითი რიცხვია."

# 3) მომხმარებელს შემოატანინე პაროლი. თუ პაროლი არის "python123", დაბეჭდე:
# "პაროლი სწორია."

# 4) მომხმარებელს შემოატანინე თავისი ქულა. თუ ქულა არის 90 ან მეტი, დაბეჭდე:
# "შესანიშნავი შედეგი!"

# 5) მომხმარებელს შემოატანინე ტემპერატურა. თუ ტემპერატურა 0-ზე ნაკლებია, დაბეჭდე:
# "გარეთ ყინავს."

# 6) მომხმარებელს შემოატანინე სახელი. თუ შემოტანილი სახელი არის "Giorgi", დაბეჭდე:
# "მოგესალმები, Giorgi!"

# 7) მომხმარებელს შემოატანინე რიცხვი. თუ ის ლუწია, დაბეჭდე:
# "ლუწი რიცხვია."

# 8) მომხმარებელს შემოატანინე თანხა. თუ თანხა არის 100 ან მეტი, დაბეჭდე:
# "შეგიძლია ფასდაკლების მიღება."

# 9) მომხმარებელს შემოატანინე კვირის დღე. თუ შემოტანილია "Sunday", დაბეჭდე:
# "დღეს დასვენების დღეა."

# 10) მომხმარებელს შემოატანინე ორი რიცხვი. თუ პირველი რიცხვი მეორეზე მეტია, დაბეჭდე:
# "პირველი რიცხვი უფრო დიდია."

#1)
age=int(input("enter your age"))
print(age)



































































