#1) while loop-ის გამოყენებით გამოიტანეთ რიცხვები 1-დან 20-მდე. როდესაც რიცხვი გახდება 10, გამოიყენეთ break და გააჩერეთ ციკლი.

#2) while loop-ის გამოყენებით გამოთვალეთ 1-დან 50-მდე ყველა რიცხვის ჯამი. გამოიყენეთ total ცვლადი.

#3)მომხმარებელს შემოატანინეთ რიცხვები. სანამ მომხმარებელი არ შეიყვანს 0-ს, დაამატეთ ყველა რიცხვი total ცვლადში. 0-ის შეყვანისას
#გამოიყენეთ break და ბოლოს გამოიტანეთ ჯამი.

#4) while loop ის გამოყენებით გამოთვალეთ 1 დან 200 მდე ყველა კენტი რიცხვის ჯამი და შეინახეთ sum ცვლადში და გამოიტანეთ

#1)
i = 1
while i <= 20:
    print(i)
    if i == 10:
        break
    i += 1

#2)

total = 0
i = 1

while i <= 50:
    total += i
    i += 1


#3)
total = 0

while True:
    number = int(input("შემოიტანეთ რიცხვი (0-ის შეყვანა გააჩერებს პროგრამას): "))
    if number == 0:
        break
    total += number

print(f"შემოყვანილი რიცხვების ჯამია: {total}")



#4)
sum = 0
i = 1

while i < 200:
    sum += i
    i += 2

print(sum)






