# 1) მომხმარებელს შეაყვანინე ასაკი.
# თუ ასაკი 18 ან მეტია, შიგნით შეამოწმე არის თუ არა 65-ზე მეტი.
# - თუ არის, დაბეჭდე "პენსიონერი"
# - თუ არა, დაბეჭდე "ზრდასრული"
# სხვა შემთხვევაში დაბეჭდე "არასრულწლოვანი"

# 2) მომხმარებელს შეაყვანინე რიცხვი.
# თუ რიცხვი დადებითია, შიგნით შეამოწმე ლუწია თუ კენტი.
# - თუ ლუწია, დაბეჭდე "დადებითი ლუწი"
# - თუ კენტია, დაბეჭდე "დადებითი კენტი"
# სხვა შემთხვევაში დაბეჭდე "რიცხვი არ არის დადებითი"

# 3) შექმენი ცვლადი username და password.
# თუ username სწორია, შიგნით შეამოწმე password.
# - თუ password სწორია, დაბეჭდე "შესვლა წარმატებულია"
# - თუ არა, დაბეჭდე "არასწორი პაროლი"
# თუ username არასწორია, დაბეჭდე "მომხმარებელი ვერ მოიძებნა"


#1)
age = int(input("შემოყვანეთ თქვენი ასაკი: "))


if age >= 18:

    if age > 65:
        print("პენსიონერი")
    else:
        print("ზრდასრული")

else:
    print("არასრულწლოვანი")

#2)

number = int(input("შემოყვანეთ რიცხვი: "))


if number > 0:
    
    if number % 2 == 0:
        print("დადებითი ლუწი")
    else:
        print("დადებითი კენტი")

else:
    print("რიცხვი არ არის დადებითი")

#3)
correct_username = "admin"
correct_password = "secret123"

username = input("შემოყვანეთ მომხმარებლის სახელი: ")

if username == correct_username:
    password = input("შემოყვანეთ პაროლი: ")
    
    if password == correct_password:
        print("შესვლა წარმატებულია")
    else:
        print("არასწორი პაროლი")
else:
    print("მომხმარებელი ვერ მოიძებნა")



















































