# 1) შექმენი ცვლადი balance = 1000.
# მომხმარებელს შეაყვანინე თანხა.
# თუ თანხა დადებითია, შიგნით შეამოწმე ბალანსზე მეტია თუ არა.
# - თუ არა, დაბეჭდე "თანხა წარმატებით გაიტანეთ"
# - თუ მეტია, დაბეჭდე "არასაკმარისი ბალანსი"
# თუ თანხა 0 ან უარყოფითია, დაბეჭდე "არასწორი თანხა"

# 2) მომხმარებელს შეაყვანინე გამოცდის ქულა.
# თუ ქულა 50 ან მეტია, შიგნით შეამოწმე 90 ან მეტია თუ არა.
# - თუ არის, დაბეჭდე "A"
# - თუ არა, დაბეჭდე "ჩააბარა"
# თუ ქულა 50-ზე ნაკლებია, დაბეჭდე "ჩაიჭრა"

# 3) მომხმარებელს შეაყვანინე ტემპერატურა.
# თუ ტემპერატურა 0-ზე მეტია, შიგნით შეამოწმე 30-ზე მეტია თუ არა.
# - თუ არის, დაბეჭდე "ცხელა"
# - თუ არა, დაბეჭდე "თბილა"
# თუ ტემპერატურა 0 ან ნაკლებია, დაბეჭდე "ცივა"

# 4) მომხმარებელს შეაყვანინე წელი.
# თუ წელი 2000-ზე მეტია, შიგნით შეამოწმე ლუწია თუ კენტი.
# - თუ ლუწია, დაბეჭდე "ლუწი წელია"
# - თუ კენტია, დაბეჭდე "კენტი წელია"
# თუ წელი 2000-ზე ნაკლები ან ტოლია, დაბეჭდე "ძველი წელია"

# 5) მომხმარებელს შეაყვანინე პროდუქტის რაოდენობა.
# თუ რაოდენობა 0-ზე მეტია, შიგნით შეამოწმე 10-ზე მეტია თუ არა.
# - თუ არის, დაბეჭდე "მარაგი საკმარისია"
# - თუ არა, დაბეჭდე "მარაგი ცოტაა"
# თუ რაოდენობა 0-ია, დაბეჭდე "მაგარი არ არის"


#1)
balance = 1000
amount = float(input("შეიყვანეთ გასატანი თანხა: "))
if amount > 0:
    if amount <= balance:
        print("თანხა წარმატებით გაიტანეთ")
    else:
        print("არასაკმარისი ბალანსი")
else:
    print("არასწორი თანხა")

#2)
score = int(input("შეიყვანეთ გამოცდის ქულა: "))
if score >= 50:
    if score >= 90:
        print("A")
    else:
        print("ჩააბარა")
else:
    print("ჩაიჭრა")


#3)
temperature = int(input("შეიყვანეთ ტემპერატურა: "))
if temperature > 0:
    if temperature > 30:
        print("ცხელა")
    else:
        print("თბილა")
else:
    print("ცივა")


#4)
year = int(input("შეიყვანეთ წელი: "))
if year > 2000:
    if year % 2 == 0:
        print("ლუწი წელია")
    else:
        print("კენტი წელია")
else:
    print("ძველი წელია")



#5)
quantity = int(input("შეიყვანეთ პროდუქტის რაოდენობა: "))
if quantity > 0:
    if quantity > 10:
        print("მარაგი საკმარისია")
    else:
        print("მარაგი ცოტაა")
else:
    print("მაგარი არ არის")

















