# 1. მომხმარებელს შემოატანინე რიცხვი.
# თუ რიცხვი დადებითია, დაბეჭდე `"დადებითი რიცხვია"`.
# თუ რიცხვი უარყოფითია, დაბეჭდე `"უარყოფითი რიცხვია"`.
# სხვა შემთხვევაში, დაბეჭდე `"ნულის ტოლია"`.

# 2. მომხმარებელს შემოატანინე ასაკი.
# თუ ასაკი ნაკლებია 18-ზე, დაბეჭდე `"არასრულწლოვანი"`.
# თუ ასაკი 18-დან 64-მდეა, დაბეჭდე `"ზრდასრული"`.
# სხვა შემთხვევაში, დაბეჭდე `"პენსიონერი"`.

# 3. მომხმარებელს შემოატანინე გამოცდის ქულა.
# თუ ქულა 90-100 შუალედშია, დაბეჭდე `"A"`.
# თუ ქულა 80-89 შუალედშია, დაბეჭდე `"B"`.
# თუ ქულა 70-79 შუალედშია, დაბეჭდე `"C"`.
# თუ ქულა 60-69 შუალედშია, დაბეჭდე `"D"`.
# სხვა შემთხვევაში, დაბეჭდე `"F"`.


#1)
x = int(input("შემოიტანეთ რიცხვი: "))

if x > 0:
    print("დადებითი რიცხვია")
elif x < 0:
    print("უარყოფითი რიცხვია")
else:
    print("ნულის ტოლია")

#2)
age = int(input("შემოიტანეთ თქვენი ასაკი: "))

if age < 18:
    print("არასრულწლოვანი")
elif 18 <= age <= 64:
    print("ზრდასრული")
else:
    print("პენსიონერი")


#3)
score = float(input("შემოიტანეთ გამოცდის ქულა: "))

if 90 <= score <= 100:
    print("A")
elif 80 <= score < 90:
    print("B")
elif 70 <= score < 80:
    print("C")
elif 60 <= score < 70:
    print("D")
else:
    print("F")




















