#1) კომენტარებით ჩამოწერე ყველა მათემატიკური ოპერატორი (+, -, *, /, %, **) და თითოეულზე დაწერე თითო მაგალითი.

#2) შექმენი ორი ცვლადი num1 და num2, გაუტოლე მნიშვნელობები 30 და 15. დაბეჭდე მათი ჯამი, სხვაობა, ნამრავლი, განაყოფი და ნაშთი.

#3) შექმენი სამი ცვლადი: a = 10, b = 20, c = 30. დაბეჭდე სამივე რიცხვის ჯამი.

#4) შექმენი სამი ცვლადი: num1 = 8, num2 = 4, num3 = 2. შეასრულე ოპერაცია (num1 + num2) * num3 და დაბეჭდე შედეგი.

#5) შექმენი ორი ცვლადი x და y. გაუტოლე მნიშვნელობები 50 და 25. ჯერ იპოვე მათი სხვაობა, შემდეგ მიღებული შედეგი გაამრავლე 2-ზე.

#6) შექმენი ცვლადი age და შეინახე მნიშვნელობა 18. შემდეგ შექმენი კიდევ ერთი ცვლადი nextAge, რომელიც იქნება age + 1. დაბეჭდე ორივ

#7) შექმენი ცვლადი price = 200 და discount = 35. გამოთვალე ფასდაკლების შემდეგ დარჩენილი თანხა და დაბეჭდე.

#8) შექმენი ცვლადი number = 9. იპოვე მისი კვადრატი (square) და დაბეჭდე შედეგი.

#9) შექმენი ოთხი ცვლადი: a = 5, b = 10, c = 15, d = 20. დაბეჭდე ყველა რიცხვის ჯამი.

#10) შექმენი ორი ცვლადი width = 12 და height = 8. გამოთვალე მართკუთხედის ფართობი და დაბეჭდე.

#1)
- 5 + 7=13
- 17 - 11=6
- 79 * 32=2528
- 15 / 5=3
- 99 % 30=9
- 44 ** 2=88
 
 #2)
num1=30
num2=15
- 30 + 15=45
- 30 - 15=15
- 30 / 15=2
- 30 * 15=450
- 30 % 15=0

#3)
# a + b + c=60

#4)
#num1=8
#num2=4
#num3=2
#(num1 + num2)*num3=24

#5)
x=50
y=25
- 50 - 25=25
- 25 * 2=50

#6)
age=18
nextage=19

#7)
pric=200
discout=35
- 200 / 50=100








#8)
number=9**2
nymber=81
print(nymber)

#9)
a=5
b=10
c=15
d=20
# a + b + c + d=50

#10)
width=12
height=8
area=8*12
print(area)












