#1. მომხმარებელს შეაყვანინე ორი რიცხვი და დაბეჭდე მათი ჯამი, სხვაობა, ნამრავლი და განაყოფი.

#2. მომხმარებელს შეაყვანინე რიცხვი, გამოაკელი 5 და შეადარე მიღებული შედეგი 20-ს. დაბეჭდე შედარების შედეგი.

#3. მომხმარებელს შეაყვანინე ორი რიცხვი და შეამოწმე:
 #არის თუ არა მათი ჯამი 50-ზე მეტი;
 #არის თუ არა მათი ნამრავლი 100-ის ტოლი;
 #არის თუ არა პირველი რიცხვი მეორეზე ნაკლები.

#4. მომხმარებელს შეაყვანინე რიცხვი და შეამოწმე, იყოფა თუ არა ის 3-ზე ნაშთის გარეშე `%` ოპერატორის გამოყენებით.

#5. მომხმარებელს შეაყვანინე ორი რიცხვი და დაბეჭდე პირველი რიცხვის მეორეზე გაყოფის შედეგი `/`-ით, მთელზე გაყოფის შედეგი `//`-ით და ნაშთი `%`-ით.

#6. მომხმარებელს შეაყვანინე რიცხვი და დაბეჭდე მისი კვადრატი და კუბი `**` ოპერატორის გამოყენებით.

#7. მომხმარებელს შეაყვანინე ორი რიცხვი და შეამოწმე, არის თუ არა მათი სხვაობა 10-ზე მეტი, ნაკლები ან ტოლი.

#8. მომხმარებელს შეაყვანინე რიცხვი და დაბეჭდე:
   #რიცხვი გამრავლებული 3-ზე;
   #რიცხვი აყვანილი მე-3 ხარისხში;
   #რიცხვის 5-ზე გაყოფის ნაშთი;
   #რიცხვის 5-ზე მთელზე გაყოფის შედეგი.


#1)
num1=12
num2=14

print(12 + 14)
print(12 - 14)
print(12 * 14)
print(12 / 14)

#2)
num1=15
num2=20

print(15 - 5)
print(20 > 10)

#3)
num1=50
num2=2

print(50 + 2)
print(50 * 2)
print(50 > 2)

#4)
num1=6
num=3

print(6 % 3)

#5)
num1=55
num2=5

print(55 / 5)
print(55 // 5)

#6)
num1=15
num2=30

print(15 ** 2)
print(15 ** 3)

print(30 ** 2)
print(30 ** 3)

#7)

num1=30
num2=20

print(30 - 20)

#8)
num1=5

print(5 * 3)
print(5 ** 3)
print(5 % 5)
print(5 // 5)










