1. #მომხმარმებელს შეაყვანინე ასაკი და შეამოწმე, არის თუ არა ის 18 წლის ან მეტი.
2. #მომხმარებელს შეაყვანინე ორი რიცხვი და შეამოწმე, არის თუ არა ორივე რიცხვი 10-ზე მეტი `and`-ის გამოყენებით.
3. #მომხმარებელს შეაყვანინე ორი რიცხვი და შეამოწმე, არის თუ არა რომელიმე მათგანი 100-ზე მეტი `or`-ის გამოყენებით.
4. #შექმენი ცვლადი `is_weekend = True`. გამოიყენე `not` და დაბეჭდე მისი საპირისპირო მნიშვნელობა.
5. #მომხმარებელს შეაყვანინე ასაკი და შეამოწმე, არის თუ არა ის 16 წლის ან მეტი და 60 წლის ან ნაკლები. გამოიყენე `and`.
6. #შექმენი ორი Boolean ცვლადი: `has_ticket` და `has_invitation`. შეამოწმე, შეუძლია თუ არა ადამიანს ღონისძიებაზე შესვლა, თუ მას 
#ბილეთი ან მოწვევა აქვს. გამოიყენე `or`.
7. #მომხმარებელს შეაყვანინე ორი რიცხვი და შეამოწმე, არის თუ არა პირველი რიცხვი მეორეზე მეტი და მეორე რიცხვი 10-ზე მეტი. გამოიყენე
#`and`.
8. #შექმენი პროგრამა, რომელიც მომხმარებელს ეკითხება ასაკს და ამოწმებს, არის თუ არა ის 13 წლის ან მეტი და 18 წლის ან ნაკლები. 
#გამოიყენე `and`.



#1)
age=int(input("გთხოვთ, შეიყვანოთ თქვენი ასაკი: "))
if age >= 18:
 print("თქვენ ხართ სრულწლოვანი (18 წლის ან მეტის :).")
 print("თქვენ ხართ არასრულწლოვანი (18 წელზე ნაკლების :).")

#2)
number1 = 12
number2 = 17
num1 = float(input("enter first number: "))
num2 = float(input("enter second nuber: "))
print(num1 > 10 and num2 > 10:)
 
#3)
რიცხვი1 = float(input("enter first number: "))
რიცხვი2 = float(input("enter second nuber: "))
print(რიცხვი1 > 100 or რიცხვი2 > 100:)

#4)
is_weekend = True
print(not is_weekend)

#5)
age = 12
print( age >= 16 and age <= 60:)

#6)
has_ticket = True
has_invitation = False
print(has_ticket or has_invitation:)

#7)
num1=31
num2=33
num1 = float(input("enter second number: "))
num2 = float(input("enter first number: "))
print(num1 > num2 and num2 > 10:)

#8)
my_age=12
age = int(input("enter my_age: "))
print(age >= 13 and age <= 18:)




















