# 1)გამოიტანე რიცხვები 1-დან 20-მდე, მაგრამ continue ს გამოყენებით გამოტოვე ყველა ლუწი რიცხვი 
# 2)გამოიტანე რიცხვები 1 დან 45 მდე მაგრამ გამოტოვე ყველა რიცხვი რომელიც იყოფა 3 ზე
# 3)გამოიიტანე რიცხვები 10 დან 50 მდე მაგრამ გამოტოვე 20, 30  და 40. 
# 4)მომხამარებს შეაყვანინე 5 რიცხვი. თითვეული რიცხვი გამოიტანე მაგრამ თუ რიცხვი
# უარყოფითი გამოიყენე continue და არ დაბეჭდო.
# 5)გამოიტანე 1 დან 100 მდე ყველა რიცხვი რომელიც არ იყოფა 5 ზე გამოიყენენ continue 
# ამ რიცხვების გამოსატანად, რომლებიც 5 ზე იყოფა



#1)
for i in range(1, 21):
  if i % 2 == 0:
    continue
  print(i)


#2)
for i in range(1, 46):
  if i % 3 == 0:
    continue
  print(i)


#3)
for i in range(10, 51):
  if i in:
    continue
  print(i)


#4)
for i in range(5):
    num = int(input(f"შეიყვანეთ
 {i+1}-ე რიცხვი: "))
    
    if num < 0:
        continue
        
    print(f"თქვენ შეიყვანეთ დადებითი რიცხვი: {num}")



#5)
for i in range(1, 101):
    if i % 5 == 0:
        continue
    print(i)





















