# შექმნათ კინოთეატრის ასისტენტი პროგრამა Python-ში, რომელიც ამოწმებს მომხმარებლის ავტორიზაციას, პაროლს და ამუშავებს დარბაზის
#  მონაცემებს.
# ნაწილი 1: ავტორიზაცია და წვდომა (Nested IF)
# შექმენით ორი ცვლადი:
# is_logged_in = True
# has_subscription = False
# ჩაშენებული (nested) if-ის გამოყენებით დაწერეთ ლოგიკა:
# თუ მომხმარებელი შესულია სისტემაში (is_logged_in არის True):
# შიგნით შეამოწმეთ: თუ აქვს გამოწერა (has_subscription არის True), დაბეჭდეთ: "წვდომა გახსნილია VIP ფილმებზე!"
# თუ არ აქვს გამოწერა, დაბეჭდეთ: "გთხოვთ, შეიძინოთ VIP გამოწერა ფილმის საყურებლად."
# თუ მომხმარებელი არ არის შესული სისტემაში, დაბეჭდეთ: "გთხოვთ, გაიაროთ ავტორიზაცია."
# ნაწილი 2: უსაფრთხოების შემოწმება (While Loop)
# კინოთეატრის ადმინისტრატორის პანელში შესასვლელად საჭიროა PIN კოდის შეყვანა:
# input()-ის გამოყენებით სთხოვეთ მომხმარებელს შეიყვანოს პაროლი.
# while ციკლის გამოყენებით გააკეთეთ ისე, რომ სანამ მომხმარებელი არ შეიყვანს სწორ პაროლს: "123412345", პროგრამამ ხელახლა მოსთხოვოს პაროლის შეყვანა.
# სწორი პაროლის შეყვანის შემდეგ დაბეჭდეთ: "პაროლი სწორია! კეთილი იყოს თქვენი მობრძანება ადმინ-პანელში."
# ნაწილი 3: დარბაზისა და რიცხვების დამუშავება (While Loops)
# ადმინისტრატორის პანელში შესვლის შემდეგ, while ციკლების გამოყენებით შეასრულეთ შემდეგი 3 დავალება:
# ადგილების ნუმერაცია: გამოიტანეთ ეკრანზე დარბაზის სავარძლების ნომრები 1-დან 20-ის ჩთვლ.
# ფასდაკლების ბილეთები: გამოიტანეთ მხოლოდ კენტი რიცხვები 5-დან 50-მდე (ეს არის ფასდაკლებული ადგილების ნომრები).
# VIP რიგები: გამოიტანეთ რიცხვები 10-დან 50-მდე, რომლებიც იყოფა 10-ზე (10, 20, 30, 40, 50).
# ნაწილი 4: ბილეთის ყიდვა და ანგარიშსწორება (Input + Math + f-string)
# input()-ით ჰკითხეთ მომხმარებელს სახელი და შეინახეთ str ტიპის ცვლადში.
# ჰკითხეთ, რამდენი ბილეთის ყიდვა სურს (გადაიყვანეთ int ტიპში).
# ჰკითხეთ ერთი ბილეთის ფასი (გადაიყვანეთ float ტიპში, მაგალითად: 12.5).
# გამოთვალეთ სრული თანხა გამრავლების ოპერატორით (*).
# f-string-ისა და print()-ის გამოყენებით გამოიტანეთ საბოლოო შეტყობინება:
# "გამარჯობა [სახელი], თქვენ შეიძინეთ [რაოდენობა] ბილეთი. სულ გადასახდელი თანხაა: [ჯამური თანხა] ლარი."

is_logged_in = True
has_subscription = False



















































