#1) While loop ის გამოყენები თგამოიტანეთ 20 მდე რიცხვები

#2) გამოიტანეთ 50 მდე მხოლოდ კენტი რიცხვები

#3) გამოიტანეთ რიცხვები 50 მდე რომლებიც იყოფა 10ზ


#4)მომხმარებელ შემოატანინეთ პაროლი, სანამ პაროლი არ დაემთხვევა 102110 მანამდე ისე თავიდან შეიყვანოს მომხმარებელმა პაროლი

#1)
i = 1
while i <= 20:
    print(i)
    i += 1


#2)
i = 1
while i < 50:
    print(i)
    i += 2


#3)
i = 10
while i <= 50:
    print(i)
    i += 10



#4)
password = ""
while password != "102110":
    password = input("შემოიტანეთ პაროლი: ")

print("წვდომა დაშვებულია!")












