# 1. While loop-ის გამოყენებით გამოიტანეთ 20-დან 1-მდე რიცხვები.

# 2. გამოიტანეთ 1-დან 50-მდე მხოლოდ ლუწი რიცხვები.

# 3. გამოიტანეთ 1-დან 100-მდე რიცხვები, რომლებიც იყოფა 5-ზე.

# 4. მომხმარებელს შემოატანინეთ რიცხვი და while loop-ის გამოყენებით გამოიტანეთ 1-დან ამ რიცხვამდე ყველა რიცხვი.

# 5. მომხმარებელს შემოატანინეთ რიცხვი და გამოიტანეთ 1-დან ამ რიცხვამდე მხოლოდ კენტი რიცხვები.

# 6. მომხმარებელს შემოატანინეთ პაროლი. სანამ პაროლი არ იქნება "python123", მანამდე მომხმარებელს თავიდან შეაყვანინეთ პაროლი.


#1) 
x = 20
while x > 0:
    print(x)
    x -= 1


#2)
x = 2

while x <= 50:
    print(x)
    x += 2


#3)
x = 5

while x <= 100:
    print(x)
    x += 5


#4)
num = int(input("შემოიტანეთ რიცხვი: "))
x = 1

while x <= num:
    print(x)
    x += 1


#5)
num = int(input("შემოიტანეთ რიცხვი: "))
x = 1

while x <= num:
    print(x)
    x += 2

#6)
password = input("შემოიტანეთ პაროლი: ")

while password != "python123":
    print("პაროლი არასწორია! სცადეთ თავიდან.")
    password = input("შემოიტანეთ პაროლი: ")

print("წვდომა ავტორიზებულია!")


